RegisterApp/app/controllers/main_menu_controller.rb

INSERT INTO "products" ("lookupCode", "created_at", "updated_at") VALUES (?, ?, ?)  [["lookupCode", "abcde"], ["created_at", "2020-10-12 01:08:40.905483"], ["updated_at", "2020-10-12 01:08:40.905483"]]
---
    def test
        product = Product.new(lookupCode: "zxcbsa")
        product.save