RegisterApp/app/models/employee.rb

INSERT INTO "employees" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "253"], ["encrypted_password", "$2a$12$QuljO4SZYwlFXQaPB1JiPeSh/zEaIAqC17seDHAMjB8K3wSKqkAcy"], ["created_at", "2020-10-11 18:55:48.541726"], ["updated_at", "2020-10-11 18:55:48.541726"]]
---
  after_create do |employee|
    cart = Cart.new()
    cart.employee = self
    cart.save

SELECT "employees".* FROM "employees" ORDER BY "employees"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def self.getHighestEmployeeId
    return Employee.last.employeeId

SELECT "employees".* FROM "employees" ORDER BY "employees"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def self.anyEmployeeExists
    return (Employee.first.nil?) ? false : true